In [1]:
import os
import pandas as pd

In [2]:
pwd = os.getcwd() # pwd present working directory, current working directory

In [20]:
files = os.listdir(pwd)

In [22]:
files = [file for file in files if '.xlsx' in file]

In [23]:
print(files)

['Prudential Life.xlsx', 'New York Life.xlsx', 'AIG.xlsx']

In [27]:
df = pd.read_excel(files[0], sheet_name=None)

In [119]:
YEARS = ['2020', '2019', '2018', '2017', '2016', '2015', '2014', '2013', '2012', '2011', '2010']
dic = {
    "Years": [],
    "Tabs": [],
    "Premium": [],
    "Net Investment Income": [],
    "Description": [],
    "File Name": []
    }

In [120]:
import functools

def scraper(filename, dic):
    initial_value = {
    "Years": [],
    "Tabs": [],
    "Premium": [],
    "Net Investment Income": [],
    "Description": [],
    "File Name": []
    }
    df = pd.read_excel(filename, sheet_name=None)
    
    
    
    def dfReader(d, f):
        def composer(acc, year):
            tab = "Co. A - {} PG5".format(year)
            acc['Years'].append(year)
            acc['Tabs'].append(tab)
            description = df[tab].iloc[6][2]
            premium = df[tab].iloc[6][7]
            income = df[tab].iloc[7][7]
            acc['Premium'].append(premium)
            acc['File Name'].append(f)
            acc['Description'].append(description)
            acc["Net Investment Income"].append(income)
            return acc
        return composer
    values = functools.reduce(dfReader(df, filename), YEARS, initial_value)
    
    
    
    return values

In [121]:
frames = [pd.DataFrame(scraper(file, dic)) for file in files]
result = pd.concat(frames)

In [125]:
result.to_excel('results.xlsx')

6735462468

0      Income
1        Lost
2      Profit
3    Expenses
4        COGS
5        Cash
6      Cheque
Name: Description, dtype: object

In [30]:
columns = df2['Description']

In [31]:
columns

0      Income
1        Lost
2      Profit
3    Expenses
4        COGS
5        Cash
6      Cheque
Name: Description, dtype: object

In [32]:
df3.columns = columns

In [33]:
df3.head()

Description  Income  Lost  Profit  Expenses   COGS  Cash  Cheque
Description  Income  Lost  Profit  Expenses   COGS  Cash  Cheque
Amount         3000  5000    6000      4000  12000  3000   10000

In [34]:
df3['Income']

Description    Income
Amount           3000
Name: Income, dtype: object

In [35]:
df3.head(1)

Description  Income  Lost  Profit  Expenses  COGS  Cash  Cheque
Description  Income  Lost  Profit  Expenses  COGS  Cash  Cheque

In [36]:
df3.drop(df3.head(1).index, inplace=True)

In [37]:
df3.head()

Description Income  Lost Profit Expenses   COGS  Cash Cheque
Amount        3000  5000   6000     4000  12000  3000  10000

In [45]:
df3['Income']

Amount    3000
Name: Income, dtype: object

In [58]:
df.iloc[: , [1, 7]]

  Description  Amount
0      Income    3000
1        Lost    5000
2      Profit    6000
3    Expenses    4000
4        COGS   12000
5        Cash    3000
6      Cheque   10000

In [80]:
dff = df.loc[:, [ True if i == 'Description' or i == 'Amount' else False for i in df.columns]]

In [81]:
dff = dff.transpose()

In [87]:
(df['Description'] =='Income') & (df['Amount']== 3000)

0     True
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [88]:
dff

                  0     1       2         3      4     5       6
Description  Income  Lost  Profit  Expenses   COGS  Cash  Cheque
Amount         3000  5000    6000      4000  12000  3000   10000

In [91]:
dff.iloc[1][1]

5000

In [94]:
df.head(1)

,Unnamed: 0,Description,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Amount
0,NaN,Income,NaN,NaN,income from sales,NaN,NaN,3000

In [99]:
df.loc[1: , 'Amount': ]

   Amount
1    5000
2    6000
3    4000
4   12000
5    3000
6   10000